/****************************************Copyright (c)****************************************************
**                                        
**                                      [艾克姆科技]
**                                        IIKMSIK
**--------------File Info---------------------------------------------------------------------------------
** File name:			     main.c
** Last modified Date:         
** Last Version:		   
** Descriptions:		   使用的SDK版本-SDK_11.0.0
**						
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2016-8-26
** Version:			    1.0
** Descriptions:		GPIO控制蜂鸣器实验
**--------------------------------------------------------------------------------------------------------*/
#include <stdint.h>
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "boards.h"

#define BEEP    12
/* 开发板中蜂鸣器占用的nRF52832管脚资源
P0.12：输出：驱动3.3V有源蜂鸣器

需要短接对应的跳线帽
*/

/**********************************************************************************************
 * 描  述 : main函数
 * 入  参 : 无
 * 返回值 : 无
 ***********************************************************************************************/ 
int main(void)
{
	nrf_gpio_cfg_output(BEEP);  //配置P0.12为输出
  nrf_gpio_pin_clear(BEEP);   //蜂鸣器初始状态为不鸣响

  while (true)
  {
    //蜂鸣器以200ms的间隔鸣响
		nrf_gpio_pin_toggle(BEEP);
		nrf_delay_ms(200);
  }
}
/********************************************END FILE*******************************************/
