/****************************************Copyright (c)****************************************************
**                                        
**                                      [艾克姆科技]
**                                        IIKMSIK
**--------------File Info---------------------------------------------------------------------------------
** File name:			     main.c
** Last modified Date:          
** Last Version:		   
** Descriptions:		   使用的SDK版本-SDK_11.0.0
**						
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2016-10-2
** Version:			    1.0
** Descriptions:		继电器驱动实验
**--------------------------------------------------------------------------------------------------------*/
#include <stdint.h>
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "boards.h"


#define   RELAY_CTRL    11   //定义P0.11管脚驱动继电器

/* 开发板中继电器驱动占用的nRF52832管脚资源
P0.11：输出：驱动指示灯D1


需要短接对应的跳线帽
*/

/**********************************************************************************************
 * 描  述 : main函数
 * 入  参 : 无
 * 返回值 : 无
 ***********************************************************************************************/ 
int main(void)
{
	  //配置用于驱动继电器的管脚
    nrf_gpio_cfg_output(RELAY_CTRL);//配置P0.11为输出，驱动继电器
    nrf_gpio_pin_clear(RELAY_CTRL); //继电器初始状态为释放


    while (true)
    {
		    nrf_gpio_pin_set(RELAY_CTRL);    //继电器吸合
			  nrf_delay_ms(500);
			  nrf_gpio_pin_clear(RELAY_CTRL);  //继电器释放
			  nrf_delay_ms(500);
		}     
}
/********************************************END FILE*******************************************/
