/****************************************Copyright (c)****************************************************
**                                        
**                                      [艾克姆科技]
**                                        IIKMSIK
**--------------File Info---------------------------------------------------------------------------------
** File name:			     main.c
** Last modified Date:          
** Last Version:		   
** Descriptions:		   使用的SDK版本-SDK_12.1.0
**						
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2016.10.1
** Version:			    1.0
** Descriptions:		触摸按键检测实验
**--------------------------------------------------------------------------------------------------------*/
#include <stdint.h>
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "boards.h"



/* 开发板中触摸按键占用的nRF52832管脚资源
P0.03：输入：检测触摸按键状态

需要短接对应的跳线帽
*/
#define TOUCH_PIN  3
/**********************************************************************************************
 * 描  述 : main函数
 * 入  参 : 无
 * 返回值 : 无
 ***********************************************************************************************/ 
int main(void)
{
	nrf_gpio_cfg_output(LED_1);//配置P0.17为输出，驱动指示灯D1
  nrf_gpio_pin_set(LED_1);   //LED初始状态为熄灭
	nrf_gpio_cfg_input(TOUCH_PIN,NRF_GPIO_PIN_PULLUP);//配置P0.03为输入，检测触摸按键状态

  while (true)
  {
    //接触触摸按键时输出高电平
		if(nrf_gpio_pin_read(TOUCH_PIN) == 1)
		{
			nrf_gpio_pin_clear(LED_1);		
		}
		else nrf_gpio_pin_set(LED_1);
  }
}
/********************************************END FILE*******************************************/
