/****************************************Copyright (c)****************************************************
**                                        
**                                      [艾克姆科技]
**                                        IIKMSIK
**--------------File Info---------------------------------------------------------------------------------
** File name:			     main.c
** Last modified Date:          
** Last Version:		   
** Descriptions:		   使用的SDK版本-SDK_12.1.0
**						
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2016-10-1
** Version:			    1.0
** Descriptions:		GPIO输出控制LED实验
**--------------------------------------------------------------------------------------------------------*/
#include <stdint.h>
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "boards.h"



/* 开发板中LED占用的nRF51822管脚资源
P0.17：输出：驱动指示灯D1
P0.18：输出：驱动指示灯D2
P0.19：输出：驱动指示灯D3
P0.20：输出：驱动指示灯D4

需要短接对应的跳线帽
*/

/**********************************************************************************************
 * 描  述 : main函数
 * 入  参 : 无
 * 返回值 : 无
 ***********************************************************************************************/ 
int main(void)
{
	  //配置用于控制LED指示灯的管脚
    nrf_gpio_cfg_output(LED_1);//配置P0.17为输出
    nrf_gpio_pin_set(LED_1);   //指示灯D1初始状态为熄灭
	   nrf_gpio_cfg_output(LED_2);//配置P0.17为输出
    nrf_gpio_pin_set(LED_2);   //指示灯D1初始状态为熄灭
	    nrf_gpio_cfg_output(LED_3);//配置P0.17为输出
    nrf_gpio_pin_set(LED_3);   //指示灯D1初始状态为熄灭
	    nrf_gpio_cfg_output(LED_4);//配置P0.17为输出
    nrf_gpio_pin_set(LED_4);   //指示灯D1初始状态为熄灭


    while (true)
    {
        //指示灯D1以200ms的间隔闪烁
		    nrf_gpio_pin_toggle(LED_1);
			nrf_gpio_pin_toggle(LED_2);

		    nrf_delay_ms(200);
						nrf_gpio_pin_toggle(LED_3);
			nrf_gpio_pin_toggle(LED_4);
		}     
}
/********************************************END FILE*******************************************/
